ws/resources/objectRepo/xmlTemplates/MDM/HotelConfig/req_CreateAttractions.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateAttractionsRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Attractions>
            <v91:AttractionCode Code="?" HotelCode="?" InactiveDate="?" Latitude="?" Longitude="?" Region="?">
               <v91:Name>
                  <v91:DefaultText/>
                  <v91:TranslatedTexts>
                     <v91:Text Lang="?"/>
                  </v91:TranslatedTexts>
               </v91:Name>
               <v91:Type/>
               <v91:Class/>
               <v91:GeneralDirections/>
               <v91:RelativePosition Distance="?" DistanceType="?" DrivingTime="?"/>
               <v91:Address BarCode="?" CreateDateTime="?" CreatorID="?" LastModifierID="?" LastModifyDateTime="?" PrimaryInd="?" PurgeDate="?" Type="?" TypeDescription="?" UpdateReservations="?">
                  <v91:AddressLine/>
                  <v91:CityName/>
                  <v91:PostalCode/>
                  <v91:CityExtension/>
                  <v91:County/>
                  <v91:State/>
                  <v91:CountryName Code="?"/>
                  <v91:Language/>
               </v91:Address>
               <v91:Website OrderSequence="?" PrimaryInd="?" Type="?" TypeDescription="?"/>
               <v91:PriceRange/>
               <v91:OperationHours/>
               <v91:DisplaySeq/>
            </v91:AttractionCode>
         </v9:Attractions>
      </v9:CreateAttractionsRQ>
   </soapenv:Body>
</soapenv:Envelope>